WITH hanbai_tanka_avg as(
  SELECT
    shohin_id,
-- 商品分類ごとの販売単価の平均値
    AVG(hanbai_tanka)
      OVER (PARTITION BY shohin_bunrui) tanka_avg
  FROM
    Shohin
) -- 本文を簡潔にするために切り出し

SELECT
  s.shohin_id,
  shohin_mei,
  shohin_bunrui,
  hanbai_tanka,
  s_avg.tanka_avg,
  hanbai_tanka - s_avg.tanka_avg diff -- 販売単価と平均価格の差分
FROM
  Shohin s
  INNER JOIN hanbai_tanka_avg s_avg
    ON s.shohin_id = s_avg.shohin_id
ORDER BY
  shohin_id
;

/*
+-----------+-----------------------+--------------------+--------------+-----------+------------+
| shohin_id | shohin_mei            | shohin_bunrui      | hanbai_tanka | tanka_avg | diff       |
+-----------+-----------------------+--------------------+--------------+-----------+------------+
| 0001      | Tシャツ                | 衣服                |         1000 | 2500.0000 | -1500.0000 |
| 0002      | 穴あけパンチ            | 事務用品             |          500 |  300.0000 |   200.0000 |
| 0003      | カッターシャツ           | 衣服                |         4000 | 2500.0000 |  1500.0000 |
| 0004      | 包丁                   | キッチン用品         |         3000 | 2795.0000 |   205.0000 |
| 0005      | 圧力鍋                 | キッチン用品          |         6800 | 2795.0000 |  4005.0000 |
| 0006      | フォーク                | キッチン用品         |          500 | 2795.0000 | -2295.0000 |
| 0007      | おろしがね              | キッチン用品          |          880 | 2795.0000 | -1915.0000 |
| 0008      | ボールペン              | 事務用品             |          100 |  300.0000 |  -200.0000 |
+-----------+-----------------------+--------------------+--------------+-----------+------------+
*/
